Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/M10B.tmx
Source language: en_us
Languages: zh_cn

source: The Last Night of the World
zh_cn: 世界的最后一夜

source: "What would you do if you knew this was the last night of the world?"
zh_cn: “要是你知道这是世界的最后一夜，你会做什么？”

source: "What would I do; you mean, seriously?"
zh_cn: “我会做什么？你是认真的？”

source: "Yes, seriously."
zh_cn: “对，认真的。”

source: "I don't know- I hadn't thought.
zh_cn: “我不知道——我没想过。”

source: She turned the handle of the silver coffeepot toward him and placed the two cups in their saucers.
zh_cn: 她把银咖啡壶的手柄转向他，将两个杯子放在他们的碟子上。

source: He poured some coffee.
zh_cn: 他倒了些咖啡。

source: In the background, the two small girls were playing blocks on the parlor rug in the light of the green hurricane lamps.
zh_cn: 远处，在绿色防风灯的灯光下两个小女孩在客厅的地毯上玩积木。

source: There was an easy, clean aroma of brewed coffee in the evening air.
zh_cn: 夜晚的空气中有一股安逸、洁净的煮咖啡的香味。

source: "Well, better start thinking about it," he said.
zh_cn: “唔，最好开始考虑这个问题，”他说。

source: "You don't mean it?" said his wife.
zh_cn: “你不是这个意思吧？”他妻子说。

source: He nodded.
zh_cn: 他点点头。

source: "A war?"
zh_cn: “战争？”

source: He shook his head.
zh_cn: 他摇摇头。

source: "Not the hydrogen or atom bomb?"
zh_cn: “不是氢弹或原子弹吧？”

source: "No."
zh_cn: “不是。”

source: "Or germ warfare?"
zh_cn: “要么是细菌战？”

source: "None of those at all," he said, stirring his coffee slowly and staring into its black depths. "But just the closing of a book, let's say."
zh_cn: “根本不是这些，”他说，慢慢地搅着他的咖啡，眼睛注视着它黑暗的深处，“而是，打个比方说，一本书到结尾了。”

source: "I don't think I understand."
zh_cn: “我想我没明白。”

source: "No, nor do I really.
zh_cn: “是的，实际上我也不明白。

source: It's jut a feeling; sometimes it frightens me, sometimes I'm not frightened at all- but peaceful."
zh_cn: 只是一种感觉；有时让我害怕，有时我一点都不怕——反而很平静。”

source: He glanced in at the girls and their yellow hair shining in the bright lamplight, and lowered his voice. "I didn't say anything to you.
zh_cn: 他瞥了一眼女孩们和她们在明亮的灯光下闪亮的黄色头发，然后压低了声音，“我没跟你说过。

source: It first happened about four nights ago."
zh_cn: 第一次是在大概四个晚上之前发生的。”

source: "What?"
zh_cn: “什么？”

source: "A dream I had.
zh_cn: “我做的一个梦。

source: I dreamt that it was all going to be over and a voice said it was; not any kind of voice I can remember, but a voice anyway, and it said things would stop here on Earth.
zh_cn: 我梦见一切都要结束了，一个声音说的确如此；那不是我能想起的任何一种声音，但总之是一个声音，它说地球上的事物就要结束了。

source: I didn't think too much about it when I awoke the next morning, but then I went to work and the feeling as with me all day.
zh_cn: 第二天醒来时我没对这事想太多，但是之后我去上班，那种感觉整天都跟随着我。

source: I caught Stan Willis looking out the window in the middle of the afternoon and I said, 'Penny for your thoughts, Stan,' and he said, 'I had a dream last night,' and before he even told me the dream, I knew what it was.
zh_cn: 在下午过半时，我撞见斯坦·威利斯（Stan Willis）正看向窗外，我说：‘在想什么呢？斯坦，’他说：‘昨晚我做了一个梦，’在他告诉我那个梦之前，我就知道了那是什么。

source: I could have told him, but he told me and I listened to him."
zh_cn: 我本来可以讲给他听的，但他跟我讲了，我就听他说。”

source: "It was the same dream?"
zh_cn: “是同样的梦？”

source: "Yes.
zh_cn: “是的。

source: I told Stan I had dreamed it, too.
zh_cn: 我告诉斯坦我也梦到了。

source: He didn't seem surprised.
zh_cn: 他好像没感到惊讶。

source: He relaxed, in fact.
zh_cn: 事实上，他很轻松。

source: Then we started walking through offices, for the hell of it.
zh_cn: 然后，为了好玩，我们开始在办公室里四处溜达。

source: It wasn't planned.
zh_cn: 没有计划过的。

source: We didn't say, let's walk around.
zh_cn: 我们没有说，我们四处走走吧。

source: We just walked on our own, and everywhere we saw people looking at their desks or their hands or out the windows and not seeing what was in front of their eyes.
zh_cn: 我们只是各走各的，在每一个地方，我们都看到人们要么看着他们的办公桌，要么看着他们的手，要么看向窗外，而对他们眼前的东西却视而不见。

source: I talked to a few of them; so did Stan."
zh_cn: 我和其中几个人谈了谈；斯坦也是。”

source: "And all of them had dreamed?"
zh_cn: “他们所有人都做梦了？”

source: "All of them.
zh_cn: “所有人。

source: The same dream, with no difference."
zh_cn: 同样的梦，分毫不差。”

source: "Do you believe in the dream?"
zh_cn: “你相信这个梦吗？”

source: "Yes. I've never been more certain."
zh_cn: “相信，我从未这么确信过。”

source: "And when will it stop?
zh_cn: “那什么时候结束呢？

source: The world, I mean."
zh_cn: 我是指，世界。”

source: "Sometime during the night for us, and then, as the night goes on around the world, those advancing portions will go, too.
zh_cn: “在我们这边是晚上的某个时刻，然后，随着夜晚绕着世界前进，那些前面的部分也要结束。

source: It'll take twenty-four hours for it all to go."
zh_cn: 全部结束要用二十四个小时。”

source: They sat awhile not touching their coffee.
zh_cn: 他们坐了一会儿，没有碰他们的咖啡。

source: Then they lifted it slowly and drank, looking at each other.
zh_cn: 然后他们慢慢端起来喝，眼睛看着对方。

source: "Do we deserve this?" she said.
zh_cn: “这是我们应得的吗？”她说。

source: "It's not a matter of deserving, it's just that things didn't work out.
zh_cn: “这不是应得不应得的事，只是事情进行不下去了。

source: I notice you didn't even argue about this. Why not?"
zh_cn: 我发觉你对这件事甚至都不争辩一下，为什么不呢？”

source: "I guess I have a reason," she said.
zh_cn: “我想是有原因的吧。”她说。

source: "The same reason everyone at the office had?"
zh_cn: “是和办公室里每一个人都有的同样的原因吗？”

source: She nodded. "I didn't want to say anything.
zh_cn: 她点点头，“我本来什么都不想说的。

source: It happened last night.
zh_cn: 我昨晚梦到了。

source: And the women on the block are talking about it, just among themselves."
zh_cn: 街区的女人们也在谈论这件事，不过只是在她们之间谈。”

source: She picked up the evening paper and held it toward him. "There's nothing in the news about it."
zh_cn: 她拿起晚报递给他，“关于这件事，新闻里什么都没有。”

source: "No, everyone knows, so what's the need?"
zh_cn: “是没有，大家都知道了，那还有什么必要？”

source: He took the paper and sat back in his chair, looking at the girls and then at her. "Are you afraid?"
zh_cn: 他接过报纸，向后靠坐在他的椅子上，看看女孩们，然后看向她，“你害怕吗？”

source: "No.
zh_cn: “不。

source: Not even for the children.
zh_cn: 即使为了孩子也没怕。

source: I always thought I would be frightened to death, but I'm not."
zh_cn: 我一直以为我会怕死，但我现在不怕。”

source: "Where's that spirit of self-preservation the scientists talk about so much?"
zh_cn: “科学家们谈论了这么多的自我保护精神在哪儿呢？”

source: "I don't know.
zh_cn: “我不知道。

source: You don't get too excited when you feel things are logical.
zh_cn: 如果你感觉事情合乎逻辑，你就不会太激动。

source: This is logical.
zh_cn: 这事合乎逻辑。

source: Nothing else but this could have happened from the way we've lived."
zh_cn: 以我们的生活方式，除此之外不可能发生其它事。”

source: "We haven't been too bad, have we?"
zh_cn: “我们没有太坏，是不是？”

source: "No, nor enormously good.
zh_cn: “是，但也不是非常好。

source: I suppose that's the trouble.
zh_cn: 我想那就是问题所在。

source: We haven't been very much of anything except us, while a big part of the world was busy being lots of quite awful things."
zh_cn: 一直以来，除了自己的事以外我们不怎么参与其它事，同时世界上的一大部分人在忙着做许多相当可怕的事。”

source: The girls were laughing in the parlor as they waved their hands and tumbled down their house of blocks.
zh_cn: 客厅里，女孩们一边挥手推倒她们的积木房子，一边哈哈大笑。

source: "I always imagined people would be screaming in the streets at a time like this."
zh_cn: “我一直以为在这样的时刻人们会在街上大喊大叫。”

source: "I guess not.
zh_cn: “我想不会。

source: You don't scream about the real thing."
zh_cn: 人不会对事实喊叫的。”

source: "Do you know, I won't miss anything but you and the girls.
zh_cn: “你知道吗，除了你和女儿们，我不会留恋任何事。

source: I never liked cities or autos or factories or my work or anything except you three.
zh_cn: 我从来都不喜欢城市、汽车、工厂、我的工作以及除了你们三个之外的任何事。

source: I won't miss a thing except my family and perhaps the change in the weather and a glass of cool water when the weather's hot, or the luxury of sleeping.
zh_cn: 除了家人，或许还有天气上的变化和天气热时的一杯凉水，或者睡觉的奢侈外，我一件事都不会留恋。

source: Just little things, really.
zh_cn: 只有小事，真的。

source: How can we sit here and talk this way?"
zh_cn: 我们怎么能坐在这里这样说话呢？”

source: "Because there's nothing else to do."
zh_cn: “因为没有其它事要做。”

source: "That's it, of course, for if there were, we'd be doing it.
zh_cn: “没错，当然了，因为要是有的话，我们应该正在做着呢。

source: I suppose this is the first time in the history of the world that everyone has really known just what they were going to be doing during the last night."
zh_cn: 我想这是世界上有史以来第一次每个人真的知道了在最后一夜他们要做什么。”

source: "I wonder what everyone else will do now, this evening, for the next few hours."
zh_cn: “我想知道别的人现在要做什么呢，在这个夜晚，在接下来的几个小时里。”

source: "Go to a show, listen to the radio, watch the TV, play cards, put the children to bed, get to bed themselves, like always."
zh_cn: “去看一场演出、听收音机、看电视、打牌、安顿孩子们上床睡觉、他们自己上床睡觉，像平常一样。”

source: "In a way that's something to be proud of- like always."
zh_cn: “用一种有点骄傲的方式——像平常一样。”
